Revit 2024 API
BuiltInFailures.FamilyFailures.TitleblockBadViewType Property
 Titleblocks can only be placed on sheets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TitleblockBadViewType { get; }
Visual Basic
Public Shared ReadOnly Property TitleblockBadViewType As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TitleblockBadViewType {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace